# Используем официальный образ Node.js в качестве базового образа
FROM node:14

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /usr/src/app

# Копируем package.json и package-lock.json в рабочую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы проекта в рабочую директорию
COPY . .

# Определяем порт, который будет открыт в контейнере
EXPOSE 3000

# Собираем приложение
RUN npm run build

# Команда для запуска вашего приложения
CMD ["npm", "start"]
